{
  "drivers": [
    {
      "id": "1",
      "createdAt": "2026-01-01T00:00:00.000Z",
      "updatedAt": "2026-01-01T00:00:00.000Z",
      "code": "D1",
      "title": "Existential Honesty",
      "body": "## To be \"Awake\"\n\nThe requirement to live without self-deception. It is the practice of stripping away comfortable narratives, ego-driven distortions, and \"confused\" thinking to see reality exactly as it is. This is the prerequisite for all effective action."
    },
    {
      "id": "2",
      "createdAt": "2026-01-01T00:00:00.000Z",
      "updatedAt": "2026-01-01T00:00:00.000Z",
      "code": "D2",
      "title": "Somatic Vitality",
      "body": "## The \"Engine\"\n\nThe requirement to be physically and mentally fit. This acknowledges that the mind is a function of the body; without biological maintenance (movement, sunlight, sleep), the engine of creation stalls. This driver powers the capacity to handle stress and complex problems. The healthy body is treated as a prerequisite for psychological stability and clarity."
    },
    {
      "id": "3",
      "createdAt": "2026-01-01T00:00:00.000Z",
      "updatedAt": "2026-01-01T00:00:00.000Z",
      "code": "D3",
      "title": "Autonomous Agency",
      "body": "## To be \"Competent & Free\"\n\nThe requirement to produce tangible value and maintain real ownership of outcomes. It is the shift from being a spectator or a manager of others' visions to being the architect of one's own. It is the drive to \"close the loop\" between a thought and a shipped reality.\n\n- Producing things that are genuinely useful to real people.\n- Being able to trace outcomes back to my own decisions and effort.\n- Owning the consequences of what I build, rather than outsourcing responsibility."
    },
    {
      "id": "4",
      "createdAt": "2026-01-01T00:00:00.000Z",
      "updatedAt": "2026-01-01T00:00:00.000Z",
      "code": "D4",
      "title": "Relational Sanctuary",
      "body": "## To be \"Known\"\n\nThe requirement to live in closeness and be known for who I am. This is the drive to dismantle defensive isolation and establish a secure, intimate base. It is the transition from a state of \"protection against loss\" to a state of \"safety through vulnerability.\"\n\n- Being able to be fully myself without earning belonging through achievement.\n- Experiencing connection that is not transactional or conditional.\n- Being chosen, not evaluated."
    }
  ],
  "problems": [
    {
      "id": "1",
      "createdAt": "2026-01-01T00:00:00.000Z",
      "updatedAt": "2026-01-01T00:00:00.000Z",
      "code": "P1",
      "title": "The Burden of Global Cruelty",
      "body": "I am weighed down by the horror of the war in Ukraine. I cannot look away, and I feel a painful disconnect from a society that seems to ignore it or refuse to act. This awareness is exhausting, but the alternative—denial—is worse."
    },
    {
      "id": "2",
      "createdAt": "2026-01-01T00:00:00.000Z",
      "updatedAt": "2026-01-01T00:00:00.000Z",
      "code": "P2",
      "title": "Selling My Life to Others",
      "body": "I am tired of building things I don't care about for people who take the majority of the profit. This imbalance leaves me disengaged and unfulfilled, regardless of role or seniority."
    },
    {
      "id": "3",
      "createdAt": "2026-01-01T00:00:00.000Z",
      "updatedAt": "2026-01-01T00:00:00.000Z",
      "code": "P3",
      "title": "Persistent Security Anxiety",
      "body": "Despite being financially competent and able to save, I carry a constant mental load about future instability—losing my footing, or lacking the means to protect and support my family. I lack a felt sense of \"enough,\" which prevents financial vigilance from ever fully disengaging."
    },
    {
      "id": "4",
      "createdAt": "2026-01-01T00:00:00.000Z",
      "updatedAt": "2026-01-01T00:00:00.000Z",
      "code": "P4",
      "title": "The Lack of a Sanctuary",
      "body": "I live in an unfinished, uninviting environment. I don't have a home that feels like a secure, beautiful base for my life, which prevents me from feeling calm or hosting others."
    },
    {
      "id": "5",
      "createdAt": "2026-01-01T00:00:00.000Z",
      "updatedAt": "2026-01-01T00:00:00.000Z",
      "code": "P5",
      "title": "Safety Through Solitude",
      "body": "I have been alone for ten years because it feels safer than being vulnerable. I have successfully protected myself from the \"fear of loss,\" but the price has been a decade without intimacy."
    },
    {
      "id": "6",
      "createdAt": "2026-01-01T00:00:00.000Z",
      "updatedAt": "2026-01-01T00:00:00.000Z",
      "code": "P6",
      "title": "Inability to Execute on Own Projects",
      "body": "I have the mastery to build almost anything, but I finish nothing for myself. I am stuck in a loop of starting projects with excitement and then abandoning them when the initial drive fades."
    },
    {
      "id": "7",
      "createdAt": "2026-01-01T00:00:00.000Z",
      "updatedAt": "2026-01-01T00:00:00.000Z",
      "code": "P7",
      "title": "Physical Neglect",
      "body": "I am watching my energy and potential decline as I age because I am not taking care of my body. I know that my physical health is the foundation for everything else, but I have a pattern of losing motivation for physical maintenance the moment professional stress increases. My fitness has historically been a 'sacrificial lamb' for my career, creating a cycle of downturns I struggle to break."
    },
    {
      "id": "8",
      "createdAt": "2026-01-01T00:00:00.000Z",
      "updatedAt": "2026-01-01T00:00:00.000Z",
      "code": "P8",
      "title": "The Absence of a Path",
      "body": "I feel like my life is a collection of disconnected pieces rather than a single story that builds over time. Even though I can see problems clearly and have great ideas, my efforts don't seem to add up to anything bigger. This makes it hard to stay committed to any one direction because I don't feel confident that what I am doing today will eventually lead to a life that feels whole."
    }
  ],
  "missions": [
    {
      "id": "1",
      "createdAt": "2026-01-01T00:00:00.000Z",
      "updatedAt": "2026-01-01T00:00:00.000Z",
      "code": "M1",
      "title": "Establish and Sustain a Personal Sanctuary",
      "body": "Build the physical, spatial, and temporal conditions that support calm, creative presence, and hospitality. This involves finalizing the home environment as a secure, beautiful base and establishing the daily routines and boundaries that protect me against reactive stress."
    },
    {
      "id": "2",
      "createdAt": "2026-01-01T00:00:00.000Z",
      "updatedAt": "2026-01-01T00:00:00.000Z",
      "code": "M2",
      "title": "Manifest Sovereign Creative Ownership",
      "body": "Transition from executing others' visions to generating, building, and completing my own products. Focus on technical authorship, the closure of ideas into tangible reality, and shifting professional effort into work where I own the output and the outcomes."
    },
    {
      "id": "3",
      "createdAt": "2026-01-01T00:00:00.000Z",
      "updatedAt": "2026-01-01T00:00:00.000Z",
      "code": "M3",
      "title": "Cultivate Secure and Generative Relationships",
      "body": "Shift from defensive isolation to intentional, trustworthy connections that allow for vulnerability and being \"known.\" Develop intimacy and relational support that provides a psychological sanctuary where I can find safety in connection rather than solitude, and belonging is not contingent on achievement."
    },
    {
      "id": "4",
      "createdAt": "2026-01-01T00:00:00.000Z",
      "updatedAt": "2026-01-01T00:00:00.000Z",
      "code": "M4",
      "title": "Build Somatic Vitality and Temporal Coherence",
      "body": "Reconstruct physical health and establish systems of habit and thought that turn my daily effort into a compounding trajectory. This mission provides the biological engine and the strategic frameworks (planning, risk management) needed to process external complexity and world events from a grounded, sovereign position."
    }
  ],
  "goals": [
    {
      "id": "1",
      "createdAt": "2026-01-01T00:00:00.000Z",
      "updatedAt": "2026-01-01T00:00:00.000Z",
      "code": "G1",
      "title": "Establish a Livable Sanctuary Baseline",
      "missionCode": "M1",
      "horizon": "2026-06-28",
      "body": "Within 6 months, my home reaches a state where it reliably supports calm, daily living and hospitality.\n\n## Finish Line\n\n- One primary living area (e.g., living room + kitchen) is fully functional, aesthetically coherent, and comfortable to inhabit daily.\n- I can invite someone over without apology or preparation anxiety.\n\n## Legitimacy\n\n**Compounding:** A stable environment reduces cognitive load every day thereafter.\n\n**Objective Evidence:** The space either supports ease or it doesn't.\n\n**Cost Structure:** Supports Somatic Vitality, Relational Sanctuary, and Existential Honesty.\n\n**Finish Line:** Clear, observable, and non-infinite.\n\n**Reversible:** Improvements remain even if other goals stall."
    },
    {
      "id": "2",
      "createdAt": "2026-01-01T00:00:00.000Z",
      "updatedAt": "2026-01-01T00:00:00.000Z",
      "code": "G2",
      "title": "Pivot to AI Engineering via Public Artifact",
      "missionCode": "M2",
      "horizon": "2026-06-28",
      "body": "Within 6 months, I will transition my professional trajectory from Frontend Management toward AI Engineering by shipping a functional, AI-integrated product.\n\n## Finish Line\n\n- A working software tool or agent that utilizes AI/LLMs is live and accessible to others.\n- I have completed a specific, self-defined curriculum or project-based learning path in AI Engineering.\n- I can demonstrate \"technical authorship\" of the AI components of the product, moving beyond pure frontend implementation.\n\n## Legitimacy\n\n**Compounding:** This goal establishes the first \"node\" of my new professional path, making future AI-related work easier to secure or build.\n\n**Objective Evidence:** A shipped AI product is binary proof of a successful pivot.\n\n**Cost Structure:** Reinforces Autonomous Agency (D3) by using the world's most powerful current tool (AI) to build for myself.\n\n**Informative:** Whether the product finds a market or not, the technical mastery gained is a permanent asset."
    },
    {
      "id": "3",
      "createdAt": "2026-01-01T00:00:00.000Z",
      "updatedAt": "2026-01-01T00:00:00.000Z",
      "code": "G3",
      "title": "Reclaim the Biological Engine",
      "missionCode": "M4",
      "horizon": "2026-06-28",
      "body": "Within 6 months, I establish a minimal, non-negotiable physical maintenance routine that runs without motivational negotiation.\n\n## Finish Line\n\n- A defined weekly movement protocol is followed for 12 consecutive weeks.\n- The protocol is simple enough to execute on the lowest-energy weeks.\n\n## Legitimacy\n\n**Compounding:** Energy, mood, and resilience increase downstream for all other goals.\n\n**Objective Evidence:** Weeks completed are countable and binary.\n\n**Cost Structure:** Directly satisfies Somatic Vitality (D2) without requiring heroic effort.\n\n**Finish Line:** Time-bound compliance, not a specific physical transformation.\n\n**Reversible:** Even partial compliance yields information to repair the engine, not the body image."
    }
  ],
  "challenges": [
    {
      "id": "1",
      "createdAt": "2026-01-01T00:00:00.000Z",
      "updatedAt": "2026-01-01T00:00:00.000Z",
      "code": "C1",
      "tier": 1,
      "title": "The Loop of the Unfinished",
      "body": "A recurring pattern in which personally owned projects are initiated with clarity and energy but abandoned once novelty fades, ambiguity increases, or risk becomes emotionally salient. This prevents the closure of work loops and blocks the accumulation of objective evidence of agency. As long as projects remain unfinished, sovereignty remains theoretical, confidence cannot compound, and vigilance is repeatedly re-triggered. This is the primary execution bottleneck."
    },
    {
      "id": "2",
      "createdAt": "2026-01-01T00:00:00.000Z",
      "updatedAt": "2026-01-01T00:00:00.000Z",
      "code": "C2",
      "tier": 1,
      "title": "Success Ambiguity",
      "body": "The absence of a clearly defined and felt sufficiency threshold for money, progress, or stability. Without an explicit sense of \"enough,\" achievements fail to register emotionally, finish lines drift, and no outcome ever resolves uncertainty. This challenge ensures that effort never produces relief. It directly sustains vigilance by making completion psychologically illegible."
    },
    {
      "id": "3",
      "createdAt": "2026-01-01T00:00:00.000Z",
      "updatedAt": "2026-01-01T00:00:00.000Z",
      "code": "C3",
      "tier": 2,
      "title": "Chronic Vigilance Load",
      "body": "A persistent background process of monitoring money, risk, and future stability. This vigilance consumes cognitive and emotional bandwidth, prevents genuine rest, and makes commitment feel dangerous. Chronic Vigilance is not the root cause but the result of unfinished loops and undefined sufficiency. As long as it remains active, life stays in a permanent preparatory mode and recovery feels irresponsible."
    },
    {
      "id": "4",
      "createdAt": "2026-01-01T00:00:00.000Z",
      "updatedAt": "2026-01-01T00:00:00.000Z",
      "code": "C4",
      "tier": 3,
      "title": "Somatic Sacrifice",
      "body": "The recurring tendency to deprioritize physical maintenance during periods of stress, uncertainty, or cognitive focus. The body becomes the first resource traded away when life feels provisional or unowned. This is not a root problem but a powerful amplifier: reduced energy, resilience, and mood intensify all other challenges and narrow the margin for error."
    },
    {
      "id": "5",
      "createdAt": "2026-01-01T00:00:00.000Z",
      "updatedAt": "2026-01-01T00:00:00.000Z",
      "code": "C5",
      "tier": 3,
      "title": "Narrative Fragmentation",
      "body": "Difficulty experiencing daily effort as part of a single, accumulating trajectory. Life feels like a series of disconnected actions rather than a coherent story that builds over time, undermining commitment and trust in the future. This challenge tends to resolve indirectly as finished work, stable routines, and compounding goals accumulate."
    },
    {
      "id": "6",
      "createdAt": "2026-01-01T00:00:00.000Z",
      "updatedAt": "2026-01-01T00:00:00.000Z",
      "code": "C6",
      "tier": 3,
      "title": "Bearing Witness Without Collapse",
      "body": "The challenge of remaining awake to global cruelty and instability without becoming paralyzed, bitter, or withdrawn. This existential load cannot be solved directly; its impact depends on physical capacity, psychological bandwidth, and whether life feels strong enough to bear awareness. As sovereignty, vitality, and sanctuary increase, this challenge becomes more manageable rather than disappearing."
    }
  ],
  "constraints": [
    {
      "id": "1",
      "createdAt": "2026-01-01T00:00:00.000Z",
      "updatedAt": "2026-01-01T00:00:00.000Z",
      "code": "S1",
      "title": "The Single-Thread Rule",
      "addresses": ["C1"],
      "body": "At any given time, I am allowed exactly one self-owned build project intended to ship. All other ideas are explicitly demoted to notes, sketches, or future candidates.\n\n## Mechanism\n\nBy removing parallel ownership, this strategy collapses optionality. Abandoning the active project no longer means switching — it means having nothing in motion.\n\n## Failure Modes\n\n- Escaping discomfort by starting something fresher\n- Diffusing energy across multiple half-projects\n- Maintaining the illusion of progress through ideation\n\n## Cost Structure Alignment\n\n- **Autonomous Agency:** Forces closure rather than ideation theater\n- **Existential Honesty:** Makes avoidance visible\n- **Somatic Vitality:** Reduces cognitive fragmentation\n\n## Signals\n\n- Boredom and resistance appear inside the project instead of triggering a new one\n- It is always obvious what I am actually working on"
    },
    {
      "id": "2",
      "createdAt": "2026-01-01T00:00:00.000Z",
      "updatedAt": "2026-01-01T00:00:00.000Z",
      "code": "S2",
      "title": "The Irreversible Finish Line",
      "addresses": ["C1", "C2"],
      "body": "Every self-owned project must define its finish line in irreversible external terms before meaningful work begins. Examples: A public URL, A GitHub release tag, A payment link, A shared demo date. Once defined, the finish line cannot be upgraded or expanded.\n\n## Mechanism\n\nThis converts completion from a subjective judgment into a binary event. It introduces factual reality that motivation alone cannot override.\n\n## Failure Modes\n\n- Moving goalposts\n- Hiding behind \"it's not ready yet\"\n- Silent abandonment\n\n## Cost Structure Alignment\n\n- **Autonomous Agency:** Produces owned outcomes, not intentions\n- **Existential Honesty:** Forces contact with reality\n- **Relational Sanctuary:** Allows work to be seen without overexposure\n\n## Signals\n\n- Anxiety increases early (a positive signal)\n- Relief replaces excitement at completion\n- Finished artifacts begin to accumulate"
    }
  ],
  "projects": [
    {
      "id": "1",
      "createdAt": "2026-01-01T00:00:00.000Z",
      "updatedAt": "2026-01-01T00:00:00.000Z",
      "code": "PRJ1",
      "title": "Daily Exercise",
      "status": "ongoing",
      "goalCodes": ["G3"],
      "body": "A minimal daily exercise routine to rebuild physical capacity and establish non-negotiable movement habits."
    },
    {
      "id": "2",
      "createdAt": "2026-01-01T00:00:00.000Z",
      "updatedAt": "2026-01-01T00:00:00.000Z",
      "code": "PRJ2",
      "title": "CORE App",
      "status": "ongoing",
      "goalCodes": ["G2"],
      "body": "A personal productivity and goal-tracking application built with React, TypeScript, and AI integration. This is the primary artifact for the AI Engineering pivot."
    },
    {
      "id": "3",
      "createdAt": "2026-01-01T00:00:00.000Z",
      "updatedAt": "2026-01-01T00:00:00.000Z",
      "code": "PRJ3",
      "title": "Frontend Restart Notes",
      "status": "done",
      "body": "Documentation and notes from the transition away from frontend management roles."
    }
  ],
  "narratives": [
    {
      "id": "1",
      "createdAt": "2026-01-01T00:00:00.000Z",
      "updatedAt": "2026-01-01T00:00:00.000Z",
      "code": "PN1",
      "type": "primary",
      "title": "The Pivot to Ownership",
      "audience": "For social settings and casual introductions.",
      "body": "I've spent the last several years leading software teams in the corporate world, but I've recently closed that chapter to return to my roots as a builder. I'm currently transitioning from Frontend Management into AI Engineering. My goal is to get back to building tools that are incredibly useful to people, similar to an open-source project I shipped years ago that actually made an impact. I'm shifting from managing other people's visions to architecting and finishing my own."
    },
    {
      "id": "2",
      "createdAt": "2026-01-01T00:00:00.000Z",
      "updatedAt": "2026-01-01T00:00:00.000Z",
      "code": "PN2",
      "type": "primary",
      "title": "The Sanctuary Project",
      "audience": "For social settings and casual introductions.",
      "body": "I'm in the middle of turning an old house in Køge into a personal sanctuary. It's not just a renovation project — it's about creating a calm, well‑designed base that supports deep work, hospitality, and a slower, more intentional way of living. Having a space I fully control is foundational for how I want to live and work."
    },
    {
      "id": "3",
      "createdAt": "2026-01-01T00:00:00.000Z",
      "updatedAt": "2026-01-01T00:00:00.000Z",
      "code": "PN3",
      "type": "primary",
      "title": "Strength With Clarity",
      "audience": "For social settings and casual introductions.",
      "body": "I tend to take the world seriously and I don't look away from uncomfortable realities — whether that's war, economic instability, or social change. At the same time, I'm focused on building enough personal strength and stability that awareness doesn't turn into anxiety. I'm interested in finding the point where realism, financial security, and creative freedom actually meet."
    },
    {
      "id": "4",
      "createdAt": "2026-01-01T00:00:00.000Z",
      "updatedAt": "2026-01-01T00:00:00.000Z",
      "code": "PN4",
      "type": "primary",
      "title": "The Holistic Engine",
      "audience": "For social settings and casual introductions.",
      "body": "I'm treating this stage of my life as a period of compounding. I'm not interested in the \"grind\" anymore; I'm engineering a lifestyle where my health, my programming, and my personal projects work as a single engine. I want to be physically fit, mentally awake, and completely free to choose which ideas I put into motion."
    },
    {
      "id": "5",
      "createdAt": "2026-01-01T00:00:00.000Z",
      "updatedAt": "2026-01-01T00:00:00.000Z",
      "code": "EN1",
      "type": "extended",
      "title": "Reclaiming a Coherent Life",
      "audience": "For trusted friends and deeper conversations.",
      "body": "For a long time my life was externally successful but internally fragmented. I was competent and productive, but my effort didn't add up to something that felt fully mine. What I'm working on now is coherence — making sure my work, health, home, and relationships reinforce each other instead of competing for energy. I'm not trying to reinvent myself; I'm trying to integrate what I already am."
    },
    {
      "id": "6",
      "createdAt": "2026-01-01T00:00:00.000Z",
      "updatedAt": "2026-01-01T00:00:00.000Z",
      "code": "EN2",
      "type": "extended",
      "title": "Strength Without Withdrawal",
      "audience": "For trusted friends and deeper conversations.",
      "body": "I'm deeply affected by large‑scale human suffering, especially the war in Ukraine. I don't believe ignoring that reality is healthy for me. At the same time, living in a permanent state of alarm isn't sustainable either. What I'm trying to build is enough personal strength — economically, physically, and emotionally — that I can stay aware without becoming paralyzed or bitter. For me, strength isn't withdrawal; it's capacity."
    },
    {
      "id": "7",
      "createdAt": "2026-01-01T00:00:00.000Z",
      "updatedAt": "2026-01-01T00:00:00.000Z",
      "code": "EN3",
      "type": "extended",
      "title": "Lowering the Drawbridge",
      "audience": "For trusted friends and deeper conversations.",
      "body": "For many years I relied on solitude as a form of protection. It kept me safe from loss, but it also slowly turned my life into a fortress that was hard to live in. I'm now intentionally working on vulnerability and closeness — letting people into my world in a measured, honest way — because I've learned that sovereignty without connection eventually becomes hollow."
    },
    {
      "id": "8",
      "createdAt": "2026-01-01T00:00:00.000Z",
      "updatedAt": "2026-01-01T00:00:00.000Z",
      "code": "EN4",
      "type": "extended",
      "title": "Closing the Vigilance Loop",
      "audience": "For trusted friends and deeper conversations.",
      "body": "Even though I'm financially competent and stable, I've carried a long‑standing fear of losing my footing or not having enough. That vigilance has been useful, but it has also become a constant mental tax. Part of my current work is defining what \"enough\" actually means for me — not as an abstract number, but as a lived sense of security that allows me to stop looking over my shoulder and focus on building."
    },
    {
      "id": "9",
      "createdAt": "2026-01-01T00:00:00.000Z",
      "updatedAt": "2026-01-01T00:00:00.000Z",
      "code": "EN5",
      "type": "extended",
      "title": "Rebuilding the Engine",
      "audience": "For trusted friends and deeper conversations.",
      "body": "I spent years neglecting my body while prioritizing work and thought. I can now feel the cost of that neglect. Rebuilding my physical health isn't about aesthetics or discipline for its own sake; it's about restoring the engine that everything else depends on. Without energy and resilience, none of my plans are real."
    }
  ],
  "contexts": [
    {
      "id": "1",
      "category": "history",
      "createdAt": "2026-01-01T00:00:00.000Z",
      "updatedAt": "2026-01-01T00:00:00.000Z",
      "body": "# HISTORY\n\n- Born in Helsingør, Denmark, on December 25th, 1972.\n- Attended Helsingør Lilleskole followed by Sortedam Gymnasium in Copenhagen after moving at age 14.\n- Childhood was marked by a severe fear of sleeping away from home and a persistent dislike of formal schooling beginning in 4th grade; I have always preferred independent study.\n- Experienced severe depression throughout my 20s.\n- Spent my 30s reinventing my identity and social circles, shifting away from my former life.\n- Entered Software Development in my 40s, progressing from Frontend Developer to Frontend Manager and eventually Head of Frontend.\n- In 2016, I successfully built and shipped an open-source software tool that achieved genuine public utility.\n- Purchased a dilapidated house in Køge in February 2022, intending to renovate it while living in it.\n\n## TRAUMAS\n\n- I was born with jaundice and lay alone for the first couple of weeks of my life.\n- I would get panic attacks as a child when I had to go to camp. I was sent anyway and expected to toughen up.\n- I had a few bad break-ups that really killed my belief in long-term relationships."
    },
    {
      "id": "2",
      "category": "current_status",
      "createdAt": "2026-01-01T00:00:00.000Z",
      "updatedAt": "2026-01-01T00:00:00.000Z",
      "body": "# CURRENT STATUS\n\n- **Personal:** 53, male, single, and in relatively good health. I have a sister (55), a niece (14), and elderly parents (82 and 88).\n- **Professional:** I was let go due to corporate restructuring in August 2025; my employment officially ended on December 1st. I am currently navigating a pivot from Engineering Management back to individual contribution, with the goal of transitioning from Frontend to AI Engineering.\n- **Financial:** I am financially competent and secure for at least the next 7 months due to insurance and disciplined saving. My primary objective is to build a personal product and establish an independent income stream.\n- **Environmental:** I am living in the Køge house. Renovation has stalled due to a lack of energy and resources, and the environment does not yet function as the sanctuary I envision.\n- **State of Mind:** I am re-engaging with programming but finding it difficult to sustain drive without a clear, compounding direction. I am currently focused on using AI to structure my thoughts and prioritize the creation of a tangible, shipped product."
    },
    {
      "id": "3",
      "category": "interests",
      "createdAt": "2026-01-01T00:00:00.000Z",
      "updatedAt": "2026-01-01T00:00:00.000Z",
      "body": "## INTERESTS\n\nThis section captures the intellectual \"fuel\" and curiosity that support my ability to remain \"Awake\" (D1) and provide context for my creative work.\n\n**Intellectual Frameworks**\n*   **Foundational Physics:** I am fascinated by how the universe works at its most basic level, with a current focus on the Wolfram Physics Project and its computational approach to reality.\n*   **History:** I am currently studying the history of the Roman Empire, seeking to understand the long-term patterns of civilization, power, and collapse.\n*   **World Politics:** I focus on global affairs and geopolitical shifts rather than local Danish politics, seeking to understand the larger forces that shape human outcomes.\n\n**Global Security & Awareness**\n*   **The War in Ukraine:** I view the 2022 invasion as the most significant event of my lifetime in Europe. I am deeply interested in the survival of Ukraine as a prerequisite for European security and am concerned by the revisionist narrative of the Russian state.\n\n**Emerging Technologies**\n*   **Artificial Intelligence:** I view AI as the most significant invention in human history—on par with fire. I am interested in how it can be used for personal empowerment, thought structuring, and the democratization of high-level engineering.\n*   **3D Printing:** I see this as a critical production paradigm for the next decade. I am interested in how it can democratize manufacturing and allow individuals to manifest physical objects as easily as software.\n\n## IDEAS\n\n- I1: If people are in full control of their money they will be more productive and happy.\n- I2: AI should curate my content, to filter out the fake and the pointless stuff.\n- I3: Belief is far more powerful than facts.\n\n## PREDICTIONS\n\n- China attacks Taiwan by end of 2027 (80%)\n- Google wins the race to AGI by 2028 (50%)\n\n## THINGS I'VE BEEN WRONG ABOUT\n\n- Thought people would realize how bad Facebook is.\n- I thought I could renovate my house in a year.\n- In my 20s I thought I wasn't a competitive person. I was just scared of losing.\n- I thought I'd get into woodworking if I had a workshop and tools, but its not really happened.\n- I thought I'd start a business in 8 years, and now its been 10."
    },
    {
      "id": "4",
      "category": "wisdom",
      "createdAt": "2026-01-01T00:00:00.000Z",
      "updatedAt": "2026-01-01T00:00:00.000Z",
      "body": "## WISDOM\n\n- Who am I -> What am I -> What is life -> What is the universe\n- The magic you're looking for is in the work you're avoiding.\n- In practice, weak people behave very similarly to evil people. Don't tie yourself to either.\n- When I am feeling low mood or low energy, 95% of the time it's because I have not 1) gotten up early, 2) gotten outside, 3) worked out, 4) gone for a walk, or done anything else physical in the last 2 days. Just go do that, and you'll instantly feel better."
    },
    {
      "id": "5",
      "category": "media",
      "createdAt": "2026-01-01T00:00:00.000Z",
      "updatedAt": "2026-01-01T00:00:00.000Z",
      "body": "## MOVIES I REMEMBER WELL ENOUGH TO CARE ABOUT\n\n- The Matrix, 1999\n- Blade Runner, 1982\n- Ran, 1985\n- The Hairdresser's Husband, 1992\n- Fight Club, 1999\n- Seven, 1995\n- Eternal Sunshine of the Spotless Mind, 2004\n\n## GREAT BOOKS\n\n- The Magician, John Fowles\n- Catcher in the Rye, J. D. Salinger\n- Dungeon Crawler Carl, Matt Dinniman\n- The Name of the Wind, Patrick Rothfuss\n- Reamde, Neal Stephenson\n- The Dreaming Void, Peter F. Hamilton\n\n### INTERESTING BOOKS\n\n- Darwin's Dangerous Idea, Daniel C. Dennet\n- The Wave, Susan Casey\n- Radical Abundance, K. Eric Drexler\n- The Information, James Gleick\n\n### Favorite Genres\n\n- LitRPG\n- Hard Sci-Fi\n- Science and Technology\n\n## BEST TV SHOWS\n\n- The Wire\n- The Sopranos\n- Breaking Bad\n\n## BEST MUSIC"
    }
  ],
  "logs": [
    {
      "id": "1",
      "date": "2026-01-01",
      "createdAt": "2026-01-01T00:00:00.000Z",
      "updatedAt": "2026-01-01T00:00:00.000Z"
    },
    {
      "id": "2",
      "date": "2025-12-31",
      "createdAt": "2025-12-31T00:00:00.000Z",
      "updatedAt": "2025-12-31T00:00:00.000Z"
    },
    {
      "id": "3",
      "date": "2025-12-30",
      "createdAt": "2025-12-30T00:00:00.000Z",
      "updatedAt": "2025-12-30T00:00:00.000Z"
    },
    {
      "id": "4",
      "date": "2025-12-29",
      "createdAt": "2025-12-29T00:00:00.000Z",
      "updatedAt": "2025-12-29T00:00:00.000Z"
    },
    {
      "id": "5",
      "date": "2025-12-28",
      "createdAt": "2025-12-28T00:00:00.000Z",
      "updatedAt": "2025-12-28T00:00:00.000Z"
    },
    {
      "id": "6",
      "date": "2025-12-27",
      "createdAt": "2025-12-27T00:00:00.000Z",
      "updatedAt": "2025-12-27T00:00:00.000Z"
    }
  ],
  "logItems": [
    {
      "id": "1",
      "logId": "1",
      "content": "Walked to the sea:",
      "createdAt": "2026-01-01T00:00:00.000Z",
      "updatedAt": "2026-01-01T00:00:00.000Z"
    },
    {
      "id": "2",
      "logId": "1",
      "content": "One strength exercise:",
      "createdAt": "2026-01-01T00:00:00.000Z",
      "updatedAt": "2026-01-01T00:00:00.000Z"
    },
    {
      "id": "3",
      "logId": "1",
      "content": "Got up late. Slept for 13 hours. Not feeling too great physically. Lots of bad dreams.",
      "createdAt": "2026-01-01T00:00:00.000Z",
      "updatedAt": "2026-01-01T00:00:00.000Z"
    },
    {
      "id": "4",
      "logId": "1",
      "content": "Work on the CORE project. Add all the routes and do the CRUD.",
      "createdAt": "2026-01-01T00:00:00.000Z",
      "updatedAt": "2026-01-01T00:00:00.000Z"
    },
    {
      "id": "5",
      "logId": "1",
      "content": "Working to learn Claude Code as well. Watching some videos on it.",
      "createdAt": "2026-01-01T00:00:00.000Z",
      "updatedAt": "2026-01-01T00:00:00.000Z"
    },
    {
      "id": "6",
      "logId": "2",
      "content": "Walked to the sea: Done",
      "createdAt": "2025-12-31T00:00:00.000Z",
      "updatedAt": "2025-12-31T00:00:00.000Z"
    },
    {
      "id": "7",
      "logId": "2",
      "content": "One strength exercise: Done",
      "createdAt": "2025-12-31T00:00:00.000Z",
      "updatedAt": "2025-12-31T00:00:00.000Z"
    },
    {
      "id": "8",
      "logId": "2",
      "content": "Another night with bad sleep. Woke up at 02:00 and couldn't get to sleep until 06:00.",
      "createdAt": "2025-12-31T00:00:00.000Z",
      "updatedAt": "2025-12-31T00:00:00.000Z"
    },
    {
      "id": "9",
      "logId": "2",
      "content": "Working on the CORE project. I will try to define the MVP.",
      "createdAt": "2025-12-31T00:00:00.000Z",
      "updatedAt": "2025-12-31T00:00:00.000Z"
    },
    {
      "id": "10",
      "logId": "2",
      "content": "Sent my New Years wishes to people and had some nice exchanges.",
      "createdAt": "2025-12-31T00:00:00.000Z",
      "updatedAt": "2025-12-31T00:00:00.000Z"
    },
    {
      "id": "11",
      "logId": "3",
      "content": "Walked to the sea: Done",
      "createdAt": "2025-12-30T00:00:00.000Z",
      "updatedAt": "2025-12-30T00:00:00.000Z"
    },
    {
      "id": "12",
      "logId": "3",
      "content": "One strength exercise: Done",
      "createdAt": "2025-12-30T00:00:00.000Z",
      "updatedAt": "2025-12-30T00:00:00.000Z"
    },
    {
      "id": "13",
      "logId": "3",
      "content": "Didn't get much sleep last night, and I'm not very energetic today",
      "createdAt": "2025-12-30T00:00:00.000Z",
      "updatedAt": "2025-12-30T00:00:00.000Z"
    },
    {
      "id": "14",
      "logId": "3",
      "content": "Finished the notes project",
      "createdAt": "2025-12-30T00:00:00.000Z",
      "updatedAt": "2025-12-30T00:00:00.000Z"
    },
    {
      "id": "15",
      "logId": "4",
      "content": "Walked to the sea: Done",
      "createdAt": "2025-12-29T00:00:00.000Z",
      "updatedAt": "2025-12-29T00:00:00.000Z"
    },
    {
      "id": "16",
      "logId": "4",
      "content": "One strength exercise: Done",
      "createdAt": "2025-12-29T00:00:00.000Z",
      "updatedAt": "2025-12-29T00:00:00.000Z"
    },
    {
      "id": "17",
      "logId": "4",
      "content": "Defined exercise project",
      "createdAt": "2025-12-29T00:00:00.000Z",
      "updatedAt": "2025-12-29T00:00:00.000Z"
    },
    {
      "id": "18",
      "logId": "4",
      "content": "Defined the frontend projects",
      "createdAt": "2025-12-29T00:00:00.000Z",
      "updatedAt": "2025-12-29T00:00:00.000Z"
    },
    {
      "id": "19",
      "logId": "4",
      "content": "Worked on Telos",
      "createdAt": "2025-12-29T00:00:00.000Z",
      "updatedAt": "2025-12-29T00:00:00.000Z"
    },
    {
      "id": "20",
      "logId": "4",
      "content": "Worked on the frontend restart notes project",
      "createdAt": "2025-12-29T00:00:00.000Z",
      "updatedAt": "2025-12-29T00:00:00.000Z"
    },
    {
      "id": "21",
      "logId": "5",
      "content": "Got up late. Not feeling so well. Slept 12 hours.",
      "createdAt": "2025-12-28T00:00:00.000Z",
      "updatedAt": "2025-12-28T00:00:00.000Z"
    },
    {
      "id": "22",
      "logId": "5",
      "content": "Spent time on a video interview with Professor Hugh White - \"Our new 'multipolar' future, split between American, Chinese, Russian, Indian, and European spheres of influence, is a 'darker world' than the golden age of US dominance.\"",
      "createdAt": "2025-12-28T00:00:00.000Z",
      "updatedAt": "2025-12-28T00:00:00.000Z"
    },
    {
      "id": "23",
      "logId": "5",
      "content": "Spent a lot of time on finishing up the first pass of the Telos project, adding minimal viable content to the documents.",
      "createdAt": "2025-12-28T00:00:00.000Z",
      "updatedAt": "2025-12-28T00:00:00.000Z"
    },
    {
      "id": "24",
      "logId": "6",
      "content": "I've worked on my Telos most of the day",
      "createdAt": "2025-12-27T00:00:00.000Z",
      "updatedAt": "2025-12-27T00:00:00.000Z"
    },
    {
      "id": "25",
      "logId": "6",
      "content": "Watched the last Mission Impossible movie, which is a rare occurrence (watching a movie). I was bored through most of it tbh.",
      "createdAt": "2025-12-27T00:00:00.000Z",
      "updatedAt": "2025-12-27T00:00:00.000Z"
    }
  ],
  "affirmations": [
    {
      "id": "1",
      "content": "I didn't get here by accident. I got here through skill, persistence, and choices I made deliberately.",
      "createdAt": "2026-01-01T00:00:00.000Z",
      "updatedAt": "2026-01-01T00:00:00.000Z"
    },
    {
      "id": "2",
      "content": "The work I'm avoiding contains the magic I'm looking for.",
      "createdAt": "2026-01-01T00:00:00.000Z",
      "updatedAt": "2026-01-01T00:00:00.000Z"
    },
    {
      "id": "3",
      "content": "I am building something that compounds. Every day of effort adds to the whole.",
      "createdAt": "2026-01-01T00:00:00.000Z",
      "updatedAt": "2026-01-01T00:00:00.000Z"
    }
  ]
}
